using System;
using System.Net.Sockets;

namespace DmyrychMessenger
{
    class Program
    {
        //програма для консольного зашифрованого текстового листування на peer-to-peer основі
        //консольний клієнт можна запустити як у режимі прийому вхідних з'єднань так і в режимі налагодження з'єднання
        //в першому випадку ми просто очікуємо доки на наш ip прийде запит на заздалегідь визначений порт
        //в другому, треба ввести ip співрозмовника
        //якщо треба перевірити працездатність на одному ПК, можна запустити додаток двічі, при чому перший запустити у режимі прийому а другий
        // - в режимі з'єднання. ip вказати 127.0.0.1 
        //з'єднання між кількома ПК - вводитити ip співрозмовника.

        //програма використовує асиметричне шифрування для передачі симетричного ключа сесії в зашифрованому вигляді, аби його не можна було
        //перехопити
        static async Task Main(string[] args)
        {
            Messaging messaging = new Messaging();
            messaging.Run();
        }
    }
}